{
    "affiliates": [
        {
            "name": " Idaho Falls Tempe",
            "phone": "208-356-7274",
            "website": "https://lds.org",
            "address": "Idaho falls, United States",
            "image": "../images/Idaho-falls.png",
            "History": "The Idaho Falls Idaho Temple was the first temple built in Idaho. The Idaho Falls Idaho Temple was the only temple dedicated by President George Albert Smith. The Idaho Falls Idaho Temple was the first temple designed with a central spire. (The design represented a return to the use of spires, as the three previously dedicated temples featured no towers or spires.) The Idaho Falls Idaho Temple was originally named the Idaho Falls Temple. The presentation of the endowment was originally delivered by live acting in the Idaho Falls Idaho Temple. The east side of the Idaho Falls Idaho Temple originally featured a series of three reflecting ponds that were filled with water lillies and small fish. In the 1960s, the ponds were converted to flowerbeds. In 2011, the concrete ponds were removed as part of a landscaping renovation and replaced with a waterfall feature. The design of the Idaho Falls Idaho Temple was inspired by a vision of an ancient Nephite temple beheld by architect John Fetzer, Sr., who had prayed for guidance. While excavating through sand for the foundation of the Idaho Falls Idaho Temple, workers encountered solid lava rock beneath—an ideal foundation for the basement walls. At the cornerstone ceremony for the Idaho Falls Idaho Temple held on October 19, 1940, six-year-old John Groberg was given the assignment to hold President David O. McKay's hat. John would later become a general authority and the temple's 14th president. Once the exterior of the temple was completed in September 1941, the interior was expected to be completed by the end of the next year. However, World War II shortages delayed completion of the temple four more years. The Idaho Falls Idaho Temple features beautiful hand-painted murals on the walls of its progressive-style ordinance rooms: Creation Room, Garden Room, World Room, Terrestrial Room (no murals), and Celestial Room. (Only two other temples feature full Celestial Room murals: the Hamilton New Zealand Temple and the Los Angeles California Temple. The corner pillars in the Logan Utah Temple Celestial Room portray a heavenly landscape, too.) The Idaho Falls Idaho Temple is one of only six temples where patrons progress through four ordinance rooms before passing into the Celestial Room. (The other five temples are the Laie Hawaii Temple, the Cardston Alberta Temple, the Mesa Arizona Temple, the Los Angeles California Temple, and the Nauvoo Illinois Temple.) In September 1983, a helicopter was employed to install an angel Moroni statue atop the spire of the previously statueless Idaho Falls Idaho Temple. The angel Moroni statue atop the Idaho Falls Idaho Temple is a casting made by LaVar Wallgren of the statue created by Torlief Knaphus for the Washington D.C. Ward chapel, which he made as a replica of Cyrus E. Dallin's statue atop the Salt Lake Temple. (Other castings of this statue stand atop the Boston Massachusetts Temple and formerly atop the Atlanta Georgia Temple.) In October 2011, a complete renovation of the landscaping of the Idaho Falls Idaho Temple was completed, which included replacement of the flowerbeds on the east side of the temple with a beautiful waterfall feature, installation of four gathering plazas—one in each quadrant of the grounds, reconfiguration of the walkway to the baptistry, and creation of a bridal courtyard on the south side of the temple. The Idaho Falls Beautification Commission awarded the project its top award for 2012 in the non-residential category. The Idaho Falls Idaho Temple was rededicated on June 4, 2017, following a two-year renovation that brought the historic temple up to code and refreshed the interior. Structural walls were reinforced, and all mechanical and electrical systems were upgraded. A separate exit was created for brides and grooms, and a large waiting room was added for wedding parties—reducing the size of the former office space. In the ordinance rooms, the original murals were restored, and the number of seats was reduced from 140 to 88 to increase roominess and improve the room-to-room progression of the temple. Finishes and furnishings were replaced throughout the temple in shades of chartreuse, purple, and gold.1",
            "Service": "Clothing rental available - No cafeteria available - No patron housing available - Distribution center nearby",
            "schedule": "Ordinances for family names must be done in proper sequence—baptism, confirmation, Melchizedek Priesthood ordination (males), initiatory, endowment, and then sealing. Please allow sufficient time to perform all the ordinances you wish to complete during your visit. For additional help and information, please call the temple.",
            "closure": "Saturday, 1 October 2022 - Wednesday, 23 November 2022 (Limited Operations) - Thursday, 24 November 2022"
        
        },
       
        {
            "name": "Rexburg Temple",
            "phone": "(208-542-5024)", 
            "website": "lds.org",
            "address": "750 S 2nd E, Rexbug ID United States",
            "image": "../images/rexburg-temple.jpeg",
            "History": "The Rexburg Idaho Temple was the third temple built in Idaho, following the Idaho Falls Idaho Temple (1945) and the Boise Idaho Temple (1984). The announcement of the Rexburg Idaho Temple came three and a half years after the announcement that two-year Ricks College would become four-year Brigham Young University–Idaho. The Rexburg Idaho Temple stands adjacent to Church-owned Brigham Young University–Idaho. The Church's other two universities; Brigham Young University in Provo, Utah, and Brigham Young University–Hawaii in Laie, Hawaii; also have adjacent temples. While most temple groundbreakings are limited to invited guests, the groundbreaking ceremony for the Rexburg Idaho Temple was open to any and all who desired to attend. Over 8,000 people crowded on the field where the temple now stands.The Rexburg Idaho Temple features beautiful ordinance room murals by Rexburg artist Leon Parson, reflecting the wildlife and landscapes of the Upper Snake River Valley. Parson was the 2010 recipient of the Eliza R. Snow Award. A wheat motif, created by Utah artist Tom Holdman, is used throughout the Rexburg Idaho Temple including most of the 700 art-glass windowpanes. The wheat stalk symbolizes the widespread agricultural industry in the area. The finest materials were used for this House of the Lord including wood imported from Africa and stone and tile from Israel. The exterior walls of the Rexburg Idaho Temple are made of 637 precast panels from 45 different molds, including the retaining wall. The material is called China White—a white quartz finish (mined in Washington state) on concrete panels. A water-proofing compound allows dust to wash off in the rain, keeping the temple a radiant white. Interest in the open house of the Rexburg Idaho Temple was so high that additional early-morning and evening tours were added to each day. Over 200,000 visitors toured the temple. The Rexburg Idaho Temple dedication was delayed one week due to the passing of President Gordon B. Hinckley on Sunday evening, January 27, 2008. President Thomas S. Monson was installed as the 16th president of The Church of Jesus Christ of Latter-day Saints on Sunday, February 3, 2008—the day originally scheduled for the dedication of the Rexburg Idaho Temple. He dedicated the temple one week later. In December 2011, the creation of the Rexburg Idaho YSA 8th Stake and Rexburg Idaho YSA 9th Stake made the Rexburg Idaho Temple District the first and only temple district to be comprised of a majority of young adult stakes (YSA and Student Married).",
            "Service": "Clothing rental available, No cafeteria available, No patron housing available, Distribution center nearby",
            "schedule": "Ordinances for family names must be done in proper sequence—baptism, confirmation, Melchizedek Priesthood ordination (males), initiatory, endowment, and then sealing. Please allow sufficient time to perform all the ordinances you wish to complete during your visit. For additional help and information, please call the temple.",
            "closure": "Saturday, 23 July 2022, Saturday, 1 October 2022"
            
        },

       
        {
            "name": " Twin Falls Temple",
            "phone": "208-563-6030",
            "website": "https://lds.org",
            "address": "1405 Eastland Dr N Twin Falls ID 83301 United States",
            "image": "../images/twin-falls.jpg",
            "History": "The Twin Falls Idaho Temple was the fourth temple built in Idaho, following the Idaho Falls Idaho Temple (1945), the Boise Idaho Temple (1984), and the Rexburg Idaho Temple (2008). In 1996, the 14 stake presidents serving in the Magic Valley co-authored a letter to President Gordon B. Hinckley expressing their desire for a temple to be built in Twin Falls. President Gordon B. Hinckley came to Twin Falls in June 2004 to select a site for the Twin Falls Idaho Temple among eight properties under consideration.The former Candleridge Golf Course, located just south of the Snake River Canyon, was purchased as the site for the Twin Falls Idaho Temple. Of the 36 acres, just over 9 acres were retained for the temple and meetinghouse. The remainder was developed into residential lots.",
            "Service": "No clothing rental available , No cafeteria available, No patron housing available, Distribution center nearby",
            "schedule": "Ordinances for family names must be done in proper sequence—baptism, confirmation, Melchizedek Priesthood ordination (males), initiatory, endowment, and then sealing. Please allow sufficient time to perform all the ordinances you wish to complete during your visit. For additional help and information, please call the temple.",
            "closure": "Monday, 12 September 2022 - Monday, 26 September 2022, Saturday, 1 October 2022, Wednesday, 23 November 2022 (Limited Operations)"
            
        },
        
        {
            "name": "Boise Temple",
            "phone": "208-356-3722",
            "website": "https://lds.org",
            "address": "1211 S Cole Rd Boise ID 83709-1871 United States",
            "image": "../images/boise-temple.jpeg",
            "History": "The Boise Idaho Temple was the second temple built in Idaho, following the Idaho Falls Idaho Temple (1945). The Boise Idaho Temple was the first six-spire temple built since the Washington D.C. Temple (1974) and the Salt Lake Temple (1893). The design, created to maximize efficiency, was adapted for 14 other temples built between 1984 and 1989. The Boise Idaho Temple is a sister building to the Dallas Texas Temple and the Chicago Illinois Temple. In 1939, President Heber J. Grant was invited to Idaho's capital where 15 prominent local businessmen offered to the Church any available site in Boise to build Idaho's first temple, but Idaho Falls was chosen due to the concentration of membership in Eastern Idaho. President Grant told the men that when membership increased in the Boise area, a temple would be built there. On December 18, 1982, approximately 5,000 members huddled on the site of the Boise Idaho Temple to witness the groundbreaking ceremony where Elder Mark E. Petersen of the Quorum of the Twelve Apostles presided.",
            "Service": "No clothing rental available, No cafeteria available, No patron housing available, Distribution center nearby",
            "schedule": "Ordinances for family names must be done in proper sequence—baptism, confirmation, Melchizedek Priesthood ordination (males), initiatory, endowment, and then sealing. Please allow sufficient time to perform all the ordinances you wish to complete during your visit. For additional help and information, please call the temple.",
            "closure": "Saturday, 1 October 2022, Monday, 10 October 2022 - Monday, 24 October 2022, Wednesday, 23 November 2022 (Limited Operations), Thursday, 24 November 2022"
            
        }
        
        
    ]
  }
  