{
    "affiliates": [
        {
            "name": " Idaho Falls Tempe",
            "phone": "208-356-7274",
            "website": "https://lds.org , 
            Temple Closure: Saturday, 1 October 2022 - Wednesday, 23 November 2022 (Limited Operations) - Thursday, 24 November 2022 - Saturday, 24 December 2022 - Saturday, 31 December 2022, Ordinace Schedule: Please allow sufficient time to perform all the ordinances you wish to complete during your visit. For additional help and information please call the temple.",
            "address": "Idaho falls, United States, History: The temple in Idaho Falls was announced on March 3, 1937. The building was designed by the church board of temple architects: Edward O. Anderson, Georgious Y. Cannon, Ramm Hansen, John Fetzer, Hyrum Pope, Lorenzo Snow Young. The exterior of the temple was completed in September 1941 and the interior was expected to be completed the following year. However, with World War II shortages, it delayed the completion of the temple for four more years. In spite of delays, church president George Albert Smith dedicated the Idaho Falls Temple just one month after the war ended, on September 23, 1945.[2] The temple was built on a 7-acre (2.8 ha) plot, has four ordinance rooms and nine sealing rooms, and has a total floor area of 92,177 square feet (8,563.5 m2).The name of the temple was changed from the Idaho Falls Temple to the Idaho Falls Idaho Temple in 1999 when the church introduced standardized naming conventions for temples worldwide, Services: Clothing rental available - No cafeteria available- No patron housing available - Distribution center nearby",
            "image": "../images/Idaho-falls.png"
        
        },
       
        {
            "name": "Rexburg Temple",
            "phone": "(208-542-5024)", 
            "website": "lds.org, Temple Closure: Saturday, 23 July 2022 - Saturday, 1 October 2022 - Wednesday, 23 November 2022, Ordinancle Schedule: Please allow sufficient time to perform all the ordinances you wish to complete during your visit.For additional help and information please call the temple.",
            "address": "750 S 2nd E, Rexbug ID United States, History:  ",
            "description": "hisyausyaisuhaisuasiuhasiasuh",
            "image": "../images/rexburg-temple.jpeg"
            
        },

       
        {
            "name": " Twin Falls Temple",
            "phone": "208-563-6030",
            "website": "https://lds.org",
            "address": "1405 Eastland Dr N Twin Falls ID 83301 United States",
            "description": "hisyausyaisuhaisuasiuhasiasuh",
            "image": "../images/twin-falls.jpg"
            
        },
        
        {
            "name": "Boise Temple",
            "phone": "208-356-3722",
            "website": "https://lds.org",
            "address": "1211 S Cole Rd Boise ID 83709-1871 United States, description: hisyausyaisuhaisuasiuhasiasuh",
            "description": "hisyausyaisuhaisuasiuhasiasuh",
            "image": "../images/boise-temple.jpeg"
            
        }
        
        
    ]
  }
  